app/Controllers/EstudianteControlador.php

SELECT *
FROM `estudiantes`
---
    public function listar()
    {
        $model = new EstudianteModelo();
        $data['estudiantes'] = $model->findAll();

SELECT *
FROM `estudiantes`
WHERE `estudiantes`.`id` = '21'
---
    public function editar($id)
    {
        $model = new EstudianteModelo();
        $data['estudiante'] = $model->find($id);